#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 2fa81b0a723047494b043025883f806b.pdb
; shader hash: 2fa81b0a723047494b043025883f806b
;
; Buffer Definitions:
;
; cbuffer g_rayGenCB
; {
;
;   struct g_rayGenCB
;   {
;
;       struct struct.RayGenConstantBuffer
;       {
;
;           struct struct.Viewport
;           {
;
;               float left;                           ; Offset:    0
;               float top;                            ; Offset:    4
;               float right;                          ; Offset:    8
;               float bottom;                         ; Offset:   12
;           
;           } viewport;                               ; Offset:    0
;
;           struct struct.Viewport
;           {
;
;               float left;                           ; Offset:   16
;               float top;                            ; Offset:   20
;               float right;                          ; Offset:   24
;               float bottom;                         ; Offset:   28
;           
;           } stencil;                                ; Offset:   16
;
;       
;       } g_rayGenCB;                                 ; Offset:    0
;
;   
;   } g_rayGenCB;                                     ; Offset:    0 Size:    32
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !59)
!1 = !DIFile(filename: "Shaders\5CRaytracing.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 39, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 39, size: 96, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !18, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 39, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 39, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 39, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !{!11, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 56, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 56, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 56, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!11, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!31 = !{!32, !42, !45, !56}
!32 = !DISubprogram(name: "IsInsideViewport", linkageName: "\01?IsInsideViewport@@YA_NV?$vector@M$01@@UViewport@@@Z", scope: !1, file: !1, line: 27, type: !33, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !4, !36}
!35 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Viewport", file: !1, line: 2, size: 128, align: 32, elements: !37)
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !36, file: !1, line: 4, baseType: !8, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !36, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !36, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !36, file: !1, line: 7, baseType: !8, size: 32, align: 32, offset: 96)
!42 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 34, type: !43, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!43 = !DISubroutineType(types: !44)
!44 = !{null}
!45 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 70, type: !46, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!46 = !DISubroutineType(types: !47)
!47 = !{null, !48, !52}
!48 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !1, line: 16, size: 128, align: 32, elements: !50)
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !49, file: !1, line: 18, baseType: !22, size: 128, align: 32)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !1, line: 21, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 67, size: 64, align: 32, elements: !54)
!54 = !{!55}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !53, file: !1, line: 67, baseType: !5, size: 64, align: 32)
!56 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 77, type: !57, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z")
!57 = !DISubroutineType(types: !58)
!58 = !{null, !48}
!59 = !{!60, !63, !65, !69}
!60 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 57, type: !61, isLocal: true, isDefinition: true, variable: i32 16)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!63 = !DIGlobalVariable(name: "Scene", linkageName: "\01?Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 23, type: !64, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A")
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 23, size: 32, align: 32, elements: !2)
!65 = !DIGlobalVariable(name: "RenderTarget", linkageName: "\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 24, type: !66, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!66 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 24, size: 128, align: 32, elements: !2, templateParams: !67)
!67 = !{!68}
!68 = !DITemplateTypeParameter(name: "element", type: !23)
!69 = !DIGlobalVariable(name: "g_rayGenCB", linkageName: "\01?g_rayGenCB@@3U?$ConstantBuffer@URayGenConstantBuffer@@@@A", scope: !0, file: !1, line: 25, type: !70, isLocal: false, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<RayGenConstantBuffer>", file: !1, line: 25, size: 32, align: 32, elements: !2, templateParams: !71)
!71 = !{!72}
!72 = !DITemplateTypeParameter(name: "T", type: !73)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayGenConstantBuffer", file: !1, line: 10, size: 256, align: 32, elements: !74)
!74 = !{!75, !76}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "viewport", scope: !73, file: !1, line: 12, baseType: !36, size: 128, align: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !73, file: !1, line: 13, baseType: !36, size: 128, align: 32, offset: 128)
!77 = !{i32 2, !"Dwarf Version", i32 4}
!78 = !{i32 2, !"Debug Info Version", i32 3}
!79 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!80 = !{!"Shaders\5CRaytracing.hlsl", !"\0D\0Astruct Viewport\0D\0A{\0D\0A    float left;\0D\0A    float top;\0D\0A    float right;\0D\0A    float bottom;\0D\0A};\0D\0A\0D\0Astruct RayGenConstantBuffer\0D\0A{\0D\0A    Viewport viewport;\0D\0A    Viewport stencil;\0D\0A};\0D\0A\0D\0Astruct RayPayload\0D\0A{\0D\0A    float4 color;\0D\0A};\0D\0A\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0A\0D\0ARaytracingAccelerationStructure Scene : register(t0, space0);\0D\0ARWTexture2D<float4> RenderTarget : register(u0);\0D\0AConstantBuffer<RayGenConstantBuffer> g_rayGenCB : register(b0);\0D\0A\0D\0Abool IsInsideViewport(float2 p, Viewport viewport)\0D\0A{\0D\0A    return (p.x >= viewport.left && p.x <= viewport.right)\0D\0A        && (p.y >= viewport.top && p.y <= viewport.bottom);\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    float2 lerpValues = (float2) DispatchRaysIndex() / (float2) DispatchRaysDimensions();\0D\0A\0D\0A    // Orthographic projection since we're raytracing in screen space.\0D\0A    float3 rayDir = float3(0, 0, 1);\0D\0A    float3 origin = float3(\0D\0A        lerp(g_rayGenCB.viewport.left, g_rayGenCB.viewport.right, lerpValues.x),\0D\0A        lerp(g_rayGenCB.viewport.top, g_rayGenCB.viewport.bottom, lerpValues.y),\0D\0A        0.0f);\0D\0A\0D\0A    if (IsInsideViewport(origin.xy, g_rayGenCB.stencil))\0D\0A    {\0D\0A        // Trace the ray.\0D\0A        // Set the ray's extents.\0D\0A        RayDesc ray;\0D\0A        ray.Origin = origin;\0D\0A        ray.Direction = rayDir;\0D\0A        // Set TMin to a non-zero small value to avoid aliasing issues due to floating - point errors.\0D\0A        // TMin should be kept small to prevent missing geometry at close contact areas.\0D\0A        ray.TMin = 0.001;\0D\0A        ray.TMax = 10000.0;\0D\0A        RayPayload payload = { float4(0, 0, 0, 0) };\0D\0A        TraceRay(Scene, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, ~0, 0, 1, 0, ray, payload);\0D\0A\0D\0A        // Write the raytraced color to the output texture.\0D\0A        RenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A    }\0D\0A    else\0D\0A    {\0D\0A        // Render interpolated DispatchRaysIndex outside the stencil window\0D\0A        RenderTarget[DispatchRaysIndex().xy] = float4(lerpValues, 0, 1);\0D\0A    }\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout RayPayload payload, in MyAttributes attr)\0D\0A{\0D\0A    float3 barycentrics = float3(1 - attr.barycentrics.x - attr.barycentrics.y, attr.barycentrics.x, attr.barycentrics.y);\0D\0A    payload.color = float4(barycentrics, 1);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout RayPayload payload)\0D\0A{\0D\0A    payload.color = float4(0, 0, 0, 1);\0D\0A}\0D\0A\0D\0A"}
!81 = !{!"Shaders\5CRaytracing.hlsl"}
!82 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/Fo", !"C:\5CUsers\5Ctuesberry\5CDocuments\5C3-2\5CDirectX12_DXR\5CBuild\5Cx64\5CDebug\5CRaytracing.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!83 = !{i32 1, i32 3}
!84 = !{i32 1, i32 6}
!85 = !{!"lib", i32 6, i32 3}
!86 = !{!87, !90, !93, null}
!87 = !{!88}
!88 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A", !"Scene", i32 0, i32 0, i32 1, i32 16, i32 0, !89}
!89 = !{i32 0, i32 4}
!90 = !{!91}
!91 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"RenderTarget", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !92}
!92 = !{i32 0, i32 9}
!93 = !{!94}
!94 = !{i32 0, %g_rayGenCB* @g_rayGenCB, !"g_rayGenCB", i32 0, i32 0, i32 1, i32 32, null}
!95 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !96, %"class.RWTexture2D<vector<float, 4> >" undef, !98, %struct.RayGenConstantBuffer undef, !100, %struct.Viewport undef, !103, %struct.RayDesc undef, !108, %struct.RayPayload undef, !113, %struct.BuiltInTriangleIntersectionAttributes undef, !115, %g_rayGenCB undef, !117}
!96 = !{i32 4, !97}
!97 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!98 = !{i32 16, !99}
!99 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!100 = !{i32 32, !101, !102}
!101 = !{i32 6, !"viewport", i32 3, i32 0}
!102 = !{i32 6, !"stencil", i32 3, i32 16}
!103 = !{i32 16, !104, !105, !106, !107}
!104 = !{i32 6, !"left", i32 3, i32 0, i32 7, i32 9}
!105 = !{i32 6, !"top", i32 3, i32 4, i32 7, i32 9}
!106 = !{i32 6, !"right", i32 3, i32 8, i32 7, i32 9}
!107 = !{i32 6, !"bottom", i32 3, i32 12, i32 7, i32 9}
!108 = !{i32 32, !109, !110, !111, !112}
!109 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!110 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!111 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!112 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!113 = !{i32 16, !114}
!114 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!115 = !{i32 8, !116}
!116 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!117 = !{i32 32, !118}
!118 = !{i32 6, !"g_rayGenCB", i32 3, i32 0}
!119 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !120, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !122, void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !125}
!120 = !{!121}
!121 = !{i32 1, !2, !2}
!122 = !{!121, !123, !124}
!123 = !{i32 2, !2, !2}
!124 = !{i32 0, !2, !2}
!125 = !{!121, !123}
!126 = !{null, !"", null, !86, !127}
!127 = !{i32 0, i64 65537}
!128 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !129}
!129 = !{i32 8, i32 10, i32 6, i32 16, i32 7, i32 8, i32 5, !130}
!130 = !{i32 0}
!131 = !{void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !"\01?MyMissShader@@YAXURayPayload@@@Z", null, null, !132}
!132 = !{i32 8, i32 11, i32 6, i32 16, i32 5, !130}
!133 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !134}
!134 = !{i32 8, i32 7, i32 5, !130}
!135 = !DILocation(line: 57, column: 9, scope: !136)
!136 = distinct !DILexicalBlock(scope: !137, file: !1, line: 46, column: 5)
!137 = distinct !DILexicalBlock(scope: !42, file: !1, line: 45, column: 9)
!138 = !DILocation(line: 60, column: 9, scope: !136)
!139 = !DILocation(line: 36, column: 34, scope: !42)
!140 = !DILocation(line: 36, column: 65, scope: !42)
!141 = !DILocation(line: 36, column: 54, scope: !42)
!142 = !DILocation(line: 36, column: 12, scope: !42)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lerpValues", scope: !42, file: !1, line: 36, type: !4)
!144 = !DIExpression(DW_OP_bit_piece, 0, 32)
!145 = !DIExpression(DW_OP_bit_piece, 32, 32)
!146 = !DILocation(line: 39, column: 12, scope: !42)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDir", scope: !42, file: !1, line: 39, type: !14)
!148 = !DIExpression()
!149 = !DILocation(line: 41, column: 60, scope: !42)
!150 = !DILocation(line: 41, column: 34, scope: !42)
!151 = !DILocation(line: 41, column: 9, scope: !42)
!152 = !DILocation(line: 42, column: 59, scope: !42)
!153 = !DILocation(line: 42, column: 34, scope: !42)
!154 = !DILocation(line: 42, column: 9, scope: !42)
!155 = !DILocation(line: 40, column: 12, scope: !42)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !42, file: !1, line: 40, type: !14)
!157 = !DIExpression(DW_OP_bit_piece, 64, 32)
!158 = !DILocation(line: 45, column: 9, scope: !137)
!159 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !32, file: !1, line: 27, type: !4)
!160 = !DILocation(line: 27, column: 30, scope: !32, inlinedAt: !161)
!161 = distinct !DILocation(line: 45, column: 9, scope: !137)
!162 = !DILocation(line: 29, column: 29, scope: !32, inlinedAt: !161)
!163 = !DILocation(line: 29, column: 17, scope: !32, inlinedAt: !161)
!164 = !DILocation(line: 29, column: 53, scope: !32, inlinedAt: !161)
!165 = !DILocation(line: 29, column: 41, scope: !32, inlinedAt: !161)
!166 = !DILocation(line: 29, column: 34, scope: !32, inlinedAt: !161)
!167 = !DILocation(line: 30, column: 29, scope: !32, inlinedAt: !161)
!168 = !DILocation(line: 30, column: 17, scope: !32, inlinedAt: !161)
!169 = !DILocation(line: 30, column: 52, scope: !32, inlinedAt: !161)
!170 = !DILocation(line: 30, column: 40, scope: !32, inlinedAt: !161)
!171 = !DILocation(line: 30, column: 33, scope: !32, inlinedAt: !161)
!172 = !DILocation(line: 30, column: 9, scope: !32, inlinedAt: !161)
!173 = !DILocation(line: 29, column: 5, scope: !32, inlinedAt: !161)
!174 = !DILocation(line: 45, column: 9, scope: !42)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !136, file: !1, line: 49, type: !176)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 49, size: 256, align: 32, elements: !177)
!177 = !{!178, !179, !180, !181}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !176, file: !1, line: 49, baseType: !15, size: 96, align: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !176, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !176, file: !1, line: 49, baseType: !15, size: 96, align: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !176, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 224)
!182 = !DILocation(line: 49, column: 17, scope: !136)
!183 = !DILocation(line: 50, column: 13, scope: !136)
!184 = !DILocation(line: 50, column: 20, scope: !136)
!185 = !DILocation(line: 51, column: 13, scope: !136)
!186 = !DILocation(line: 51, column: 23, scope: !136)
!187 = !DILocation(line: 54, column: 13, scope: !136)
!188 = !DILocation(line: 54, column: 18, scope: !136)
!189 = !DILocation(line: 55, column: 13, scope: !136)
!190 = !DILocation(line: 55, column: 18, scope: !136)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !136, file: !1, line: 56, type: !49)
!192 = !DILocation(line: 56, column: 20, scope: !136)
!193 = !DILocation(line: 56, column: 30, scope: !136)
!194 = !DILocation(line: 60, column: 56, scope: !136)
!195 = !DILocation(line: 60, column: 22, scope: !136)
!196 = !DILocation(line: 60, column: 46, scope: !136)
!197 = !DILocation(line: 61, column: 5, scope: !136)
!198 = !DILocation(line: 65, column: 22, scope: !199)
!199 = distinct !DILexicalBlock(scope: !137, file: !1, line: 63, column: 5)
!200 = !DILocation(line: 65, column: 9, scope: !199)
!201 = !DILocation(line: 65, column: 46, scope: !199)
!202 = !DILocation(line: 67, column: 1, scope: !42)
!203 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !45, file: !1, line: 70, type: !52)
!204 = !DILocation(line: 70, column: 67, scope: !45)
!205 = !DILocation(line: 72, column: 43, scope: !45)
!206 = !DILocation(line: 72, column: 38, scope: !45)
!207 = !DILocation(line: 72, column: 36, scope: !45)
!208 = !DILocation(line: 72, column: 65, scope: !45)
!209 = !DILocation(line: 72, column: 60, scope: !45)
!210 = !DILocation(line: 72, column: 58, scope: !45)
!211 = !DILocation(line: 72, column: 86, scope: !45)
!212 = !DILocation(line: 72, column: 81, scope: !45)
!213 = !DILocation(line: 72, column: 107, scope: !45)
!214 = !DILocation(line: 72, column: 102, scope: !45)
!215 = !DILocation(line: 72, column: 12, scope: !45)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "barycentrics", scope: !45, file: !1, line: 72, type: !14)
!217 = !DILocation(line: 73, column: 28, scope: !45)
!218 = !DILocation(line: 73, column: 19, scope: !45)
!219 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !45, file: !1, line: 70, type: !49)
!220 = !DILocation(line: 70, column: 42, scope: !45)
!221 = !DIExpression(DW_OP_bit_piece, 96, 32)
!222 = !DILocation(line: 74, column: 1, scope: !45)
!223 = !DILocation(line: 79, column: 19, scope: !56)
!224 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !56, file: !1, line: 77, type: !49)
!225 = !DILocation(line: 77, column: 36, scope: !56)
!226 = !DILocation(line: 80, column: 1, scope: !56)

#endif

const unsigned char g_pRaytracing[] = {
  0x44, 0x58, 0x42, 0x43, 0xd5, 0x1c, 0x89, 0x7c, 0xb6, 0x2c, 0x55, 0x4f,
  0xa9, 0xc3, 0x40, 0x3e, 0x44, 0xaf, 0xd8, 0x9a, 0x01, 0x00, 0x00, 0x00,
  0x88, 0x46, 0x00, 0x00, 0x07, 0x00, 0x00, 0x00, 0x3c, 0x00, 0x00, 0x00,
  0x4c, 0x00, 0x00, 0x00, 0x6c, 0x02, 0x00, 0x00, 0x38, 0x2b, 0x00, 0x00,
  0xa0, 0x37, 0x00, 0x00, 0xd4, 0x37, 0x00, 0x00, 0xf0, 0x37, 0x00, 0x00,
  0x53, 0x46, 0x49, 0x30, 0x08, 0x00, 0x00, 0x00, 0x04, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x52, 0x44, 0x41, 0x54, 0x18, 0x02, 0x00, 0x00,
  0x10, 0x00, 0x00, 0x00, 0x04, 0x00, 0x00, 0x00, 0x18, 0x00, 0x00, 0x00,
  0xfc, 0x00, 0x00, 0x00, 0x6c, 0x01, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00,
  0x01, 0x00, 0x00, 0x00, 0xdc, 0x00, 0x00, 0x00, 0x00, 0x67, 0x5f, 0x72,
  0x61, 0x79, 0x47, 0x65, 0x6e, 0x43, 0x42, 0x00, 0x53, 0x63, 0x65, 0x6e,
  0x65, 0x00, 0x52, 0x65, 0x6e, 0x64, 0x65, 0x72, 0x54, 0x61, 0x72, 0x67,
  0x65, 0x74, 0x00, 0x01, 0x3f, 0x4d, 0x79, 0x52, 0x61, 0x79, 0x67, 0x65,
  0x6e, 0x53, 0x68, 0x61, 0x64, 0x65, 0x72, 0x40, 0x40, 0x59, 0x41, 0x58,
  0x58, 0x5a, 0x00, 0x4d, 0x79, 0x52, 0x61, 0x79, 0x67, 0x65, 0x6e, 0x53,
